{"Levels": [
  {"name": "Magnetic Field around a Bar Magnet",
   "description": "A Bar Magnet has a magnetic field around it. Explore using a compass and understand how the magnetic field can be visualized as lines of force. Explore the effect of polarity and strength of the magnet on the magnetic field."
  },
  {"name": "Magnetic Field around an infinite current carrying wire",
   "description": "An infinite wire carrying current produces a magnetic field around itself. Explore using a compass and see the lines of force of the magnetic field. Change the current direction and magnitude to see how the field changes."
  },
  {"name": "Magnetic Field with 2 infinite current wires",
   "description": "Move the two wires around, change their current direction and magnitudes to see how the magnetic field is affected"
  },
  {"name": "Magnetic Field around an Electromagnet",
   "description": "A coil of wire carrying current is an electromagnet. It produces a magnetic field around it. The strength and direction of the magnetic field are affected by the current strength and direction."
  },
  {"name": "Dynamo - Induction of current by relative motion of a bar magnet and a coil of wire",
   "description": "Experiment with how current is induced in a coil of wire when the bar magnet is rotated or moved in its vicinity. Understand how the current induced changes with the polarity, strength of the bar magnet."
  },
  {"name": "Dynamo - Induction of current by relative motion of an electromagnet and a coil of wire",
   "description": "Experiment with how current is induced in a coil of wire when the electromagnet is rotated or moved in its vicinity. Understand how the current induced changes with the polarity, strength of the electromagnet."
  },
  {"name": "DC Motor - A current carrying coil in a magnetic field rotates to create a motor",
   "description": "Experiment with how a motor is created by passing current through a wire placed in a magnetic field. How a commutator works with Direct Current."
  },
  {"name": "AC Motor - A coil carrying Alternating Current in a magnetic field rotates to create a motor",
   "description": "Experiment with how a motor can be created by passing alternating current through a wire placed in a magnetic field. The frequency has to be matched to rate of rotation to sustain the spin."
  },
  {"name": "Catch the Science Train - Create your own coach and light it up",
   "description": "Design your own coach to attach to the Science Train. This coach will be uploaded to the website so that your friends can see it. Design a dynamo by choosing the magnet, the coil for the dynamo and the light bulb to light up your coach."
  }
],
"Resources": [
{"type": "video",
 "duration": "2:03",
 "rating":3,
 "attribution": "ibphysicshelp", 
 "url": "http://www.youtube.com/watch?v=hajIIGHPeuU", 
 "file": "data/Electromagnetism/ElectromagneticInductionIbphysicshelp",
 "description": "Bar Magnet and Coil with multimeter is used to show how current is induced when lines of magnetic field are cut. Electromagnet and coil with multimeter is used to show the same effect."
},
{"type": "web",
 "attribution": "www.magnetman.com",
 "rating":4,
 "url": "http://www.coolmagnetman.com/magindex.htm",
 "description": "A lot of information about magnets - what is magnetism, types of magnets, strengths of magnets, how magnets work, how strong are magnets, what is a magnetic field, experiments with magnets"
},
{"type": "video",
 "duration": "5:58", 
 "rating":3,
 "attribution": "TutorVista", 
 "url": "http://www.youtube.com/watch?v=KGTZPTnZBFE", 
 "file": "data/Electromagnetism/ElectromagneticInductionTutorvista",
 "description": "TutorVista - Histroy of electromagnetism from Oersted through Faraday. A voltage would be generated across a length of wire if that wire was exposed to a perpendicular magnetic field flux of changing intensity. An easy way to create a magnetic field of changing intensity is to move a permanent magnet next to a wire or coil of wire."
},
{"type": "video",
 "duration": "3:00", 
 "rating":3.5,
 "attribution": "National STEM Center, UK", 
 "url": "http://www.nationalstemcentre.org.uk/elibrary/resource/4100/electromagnetic-induction",
 "file": "data/Electromagnetism/ElectromagneticInductionNscuk",
 "description": "Produced by the National STEM Centre and the Institute of Physics, this video demonstrates the process of electromagnetic induction. It shows a simple piece of equipment that can readily be made which contains spinning magnets, a wire coil and a lamp. Spinning the magnets past the coil produces an electric current and lights the lamp."
},
{"type": "web",
 "rating":4,
 "attribution": "Arvind Gupta Toys", 
 "url": "http://www.arvindguptatoys.com/toys/motor.html",
 "description": "Very simple way to make a motor with easily accessible materials."
},
{"type": "video",
 "duration": "1:00", 
 "rating":3.5,
 "attribution": "Arvind Gupta Toys", 
 "url": "http://www.youtube.com/watch?v=vSPFwibREUg",
 "file": "data/Electromagnetism/D C MOTOR - ArvindGupta",
 "description": "Very simple and intuitive way to make a motor with easily accessible materials."
}
]
}